app/controllers/clearance_batches_controller.rb

SELECT "clearance_batches".* FROM "clearance_batches" ORDER BY "clearance_batches"."id" ASC
---
  def index
    @clearance_batches  = ClearanceBatch.all.order(:id)

SELECT  "clearance_batches".* FROM "clearance_batches" WHERE "clearance_batches"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "items".* FROM "items" WHERE "items"."clearance_batch_id" = ? ORDER BY "items"."style_id" ASC, "item_id" ASC  [["clearance_batch_id", 1]]
---
  def show
    @clearance_batch = ClearanceBatch.find(params[:id])
    @items = @clearance_batch.items.order(:style_id, :item_id)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? AND "items"."status" = ? LIMIT ?  [["id", 300], ["status", "sellable"], ["LIMIT", 1]]
SELECT COUNT(*) FROM "items" WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 1]]
INSERT INTO "clearance_batches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-07-11 22:49:44.464629"], ["updated_at", "2023-07-11 22:49:44.464629"]]
---
  def create
    clearancing_status = ClearancingService.new.process_file(params[:csv_batch_file].tempfile)
    clearance_batch    = clearancing_status.clearance_batch
    alert_messages     = []
    if clearance_batch.persisted?
      flash[:notice]  = "#{clearance_batch.items.count} items clearanced in batch #{clearance_batch.id}"
    else
      alert_messages << "No new clearance batch was added"