app/controllers/items_controller.rb

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "clearance_batches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2023-07-13 21:30:10.937347"], ["updated_at", "2023-07-13 21:30:10.937347"]]
---
    def create
        errors_list = []
        clarence_batch = ClearanceBatch.new
        begin
            item = Item.find(params[:item_id])
            if item.status == "sellable"
              item.clearance!
              clarence_batch.items = [item]
              clarence_batch.save!